[
    {
        "title": "Web/Systems Developer",
        "company": "Alfresco",
        "location": "Chicago, IL",
        "date": "Sep '20 - Present",
        "description": [
            "I just started, I'll let you know when I figure out what I'm doing."
        ],
        "image": "alfresco.png",
        "backgroundColor": "transparent",
        "id": "alfresco",
        "website": "https://alfresco.com",
        "detailed": [
            {
                "type": "text",
                "text": "Coming soon to a personal site near you"
            }
        ],
        "current": true
    },
    {
        "title": "Lead Mobile Dev",
        "company": "Eventurely",
        "location": "Notre Dame, IN",
        "date": "Mar '18 - Jul '20",
        "description": [
            "Led development of React Native cross-platform mobile app easing discovery of on-campus student groups and events"
        ],
        "image": "eventurely.jpeg",
        "backgroundColor": "#06204B",
        "id": "eventurely",
        "website": "https://eventurely.app",
        "detailed": [
            {
                "type": "text",
                "text": "Eventurely is a 100% student built cross platform mobile app focused on helping students find student groups and connections. After serving a couple years as a regular dev, I grew into the role of lead developer. My coding responsibilities included building out the majority of the initial UI and app architecture, as well as setting up all Firebase related cloud functions and data. I wrote a script to import event data from a campus provider into our database using Python and Pandas. As a team leader, I gave tutorials to help teach new concepts. Much of my time was spent reviewing code to help ensure the use of best practices. This experience has been crucial to my development and leadership skills. I now serve as an advisor."
            },
            {
                "type": "buzzwords",
                "text": "React Native, Expo, Mobx, React Hooks, Python, Leadership, Firebase, Firebase Functions"
            }
        ]
    },
    {
        "title": "SWE Intern",
        "company": "MoreSteam",
        "location": "Powell, OH",
        "date": "May - Jul '19",
        "description": [
            "Assisted in development and design of front-end dashboard view using VueJS to allow clients to easily monitor and visualize students' progress in courses"
        ],
        "image": "moresteam-white.png",
        "backgroundColor": "#06204B",
        "id": "moresteam",
        "website": "https://moresteam.com",
        "detailed": [
            {
                "type": "text",
                "text": "MoreSteam creates online courses for Lean Six Sigma training. Here I received the opportunity to drive the development of a new product called Coach View, which gives clients a dashboard view of employees' course progress. In terms of implementation, I served as the main front end developer on Coach View while I was there, and you can view a piece of my work in the image below. This is where I really learned CSS (CSS Grid ftw!). I also served as the team leader. I got an intro to Agile as well; we had daily standups and weekly sprints."
            },
            {
                "type": "buzzwords",
                "text": "VueJS, JS, CSS, C#, Agile, Columbus Clippers, ColdFusion"
            },
            {
                "type": "link",
                "text": "A glimpse into Coach View",
                "url": "https://www.moresteam.com/training/coaching-dashboard.cfm"
            },
            {
                "type": "image",
                "src": "students-widget-expanded.png",
                "alt": "Coach View"
            }
        ]
    },
    {
        "title": "SWE Intern",
        "company": "Conventus",
        "location": "San Francisco, CA",
        "date": "Jan - May '19",
        "description": [
            "Used ReactJS to create isolated components",
            "Implemented a POC push notification system using Node.js and Push API"
        ],
        "image": "conventus-logo.png",
        "backgroundColor": "#265D5B",
        "id": "conventus",
        "website": "https://www.cvlending.com/",
        "detailed": [
            {
                "type": "text",
                "text": "Conventus is a startup bridge lending company. I won't claim to know anything about loans; I was brought on to help development on their websites.  This was my first internship and was part of my Silicon Valley Semester experience through Notre Dame, where I took classes and worked this internship part-time in the Bay Area.  Most of my work focused on building ReactJS components to add to the websites, though I also wrote some bash scripts and did some webpack configuration. I also spent much of the internship building out a proof of concept push notification system to integrate into the website using Node.js and the Push and Notification APIs. Being part of a startup gave me the opportunity to experience all the great things about startups, and also some of those common things mentioned as cons. One perk of working on a team of a whopping four developers was that as an intern, I felt included and useful."
            },
            {
                "type": "link",
                "text": "More on the Silicon Valley Semester here",
                "url": "https://california.nd.edu/siliconvalley/"
            },
            {
                "type": "buzzwords",
                "text": "ReactJS, CSS, Node, Push Notifications, Bash, Webpack, Startup, Python, Pandas"
            }
        ]
    },
    {
        "title": "Xtern Bootcamp",
        "company": "TechPoint",
        "location": "Indianapolis, IN",
        "date": "May - Jun '18",
        "description": [
            "Completed 3-week intensive course focused on developing proficiency with JavaScript, ReactJS, Firebase, and skills needed for tech industry"
        ],
        "image": "techpoint.jpeg",
        "backgroundColor": "#353336",
        "id": "techpoint",
        "website": "https://techpoint.org/",
        "detailed": [
            {
                "type": "text",
                "text": "I received the opportunity to participate in the Xtern Bootcamp the summer after my sophomore year of college. For 3 weeks, a group of 30ish students, primarily from universities based in Indiana, lived at Marian University in Indianapolis to learn the ways of JavaScript and ReactJS. We were initially taught the basics of JavaScript before eventually focusing on ReactJS. To learn concepts and gain skill, we would be given a task to complete. We would then spend that day implementing a solution ourselves before coming back tomorrow and working through a solution together as a class, led by our instructor. We also had various guest talks by tech affiliated people in Indianapolis. This is really where my love for ReactJS (and of course JavaScript) started."
            },
            {
                "type": "link",
                "text": "More on the bootcamp",
                "url": "https://techpoint.org/xtern-bootcamp/"
            },
            {
                "type": "buzzwords",
                "text": "JS, ReactJS, Firebase, git, Long's Donuts, Entrepreneurship, Agile"
            }
        ]
    },
    {
        "title": "Teaching Assistant",
        "company": "Notre Dame",
        "location": "Notre Dame, IN",
        "date": "Jan - May '18",
        "description": [
            "Assisted students in using Verilog and Altera DE2 boards for Logic Design course"
        ],
        "image": "nd.jpg",
        "backgroundColor": "#041C42",
        "id": "notredame",
        "website": "https://nd.edu",
        "detailed": [
            {
                "type": "text",
                "text": "I served as a teaching assistant for the Logic Design course at Notre Dame the spring of my sophomore year. The course itself taught the fundamentals of logic both conceptually and practically, the latter through the use of Altera DE2 boards and Verilog (a hardware description language). My responsibilities included grading homework, projects, and tests, as well as providing one on one help during my office hours. This experience gave me the opportunity to improve my ability to explain and teach concepts. I also had the pleasure of trying to read other students' Verilog code to try to help them, which is when I realized for the first time how difficult it truly is to read code that is not your own. Nevertheless, it was an experience I greatly enjoyed!"
            },
            {
                "type": "buzzwords",
                "text": "Verilog, Altera DE2 FPGA, Teaching"
            }
        ]
    }
]